<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"sandbox","backend":"7bbfd7876a29b4ac0487c8c6c6ad6ab7177ce18359967d7a2def31cba6b5da6e","plan_job_ref":"Job Test Reusable Workflows #187 at https://github.com/tx-pts-dai/github-workflows/actions/runs/7900919836","plan_out_hash":"cacb4d6a4f6607a94684d26bb941115d4c2ea9a5e11b042815cddbc3f85c31c8","plan_hash":"9ec9ca116a2db1763308b57161a6043fb45e176e84c571d28c9cb5dfefb4adeb","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [Test Reusable Workflows #187](https://github.com/tx-pts-dai/github-workflows/actions/runs/7900919836)